In [1]:
import pandas as pd

In [59]:
data1 = {
    "id" : [1, 2, 3],
    "salary" : ["100", "200", "300"]
}

data2 = {
    "id" : [1],
    "salary" : ["100"]
}

In [60]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [61]:
df1

   id salary
0   1    100
1   2    200
2   3    300

In [70]:
#find the nth highest salary and return it in a table with 1 column nthhighestsalary(n) and if there is no nth highest salary then return None
def nth_highest_salary(employee, N):
    df = employee.drop_duplicates(subset=['salary'])
    df['salary'] = pd.to_numeric(df['salary'])
    sal = df['salary'].nlargest(N)
    if N > len(sal):
        return pd.DataFrame({f"getNthHighestSalary({N})": [None]})
    else:
        return pd.DataFrame({f"getNthHighestSalary({N})": [sal.iloc[-1]]})

In [72]:
nth_highest_salary(df1, 2)

   getNthHighestSalary(2)
0                     200

In [66]:
def nth_highest_salary(employee, n):
    df = employee['salary'].drop_duplicates()
    sorted_df = df.sort_values(ascending = False)

    if n > len(sorted_df):
        return pd.DataFrame({f"getNthHighestSalary({n})" : [None]})
    else:
        highest_salary = sorted_df.iloc[n-1]
        return pd.DataFrame({f"getNthHighestSalary({n})" : [highest_salary]})

In [67]:
nth_highest_salary(df1, 2)

  getNthHighestSalary(2)
0                    200